{
	"@metadata": {
		"authors": [
			"MusikAnimal",
			"Samwilson",
			"Robby"
		]
	},
	"add-category": "Link to add a new category to an event.",
	"add-more-participants": "Label for text area input to enter in multiple participants for an event.",
	"add-more-participants-tooltip": "Tooltip text for the help icon near {{msg-wm|add-more-participants}}.",
	"add-more-participants-note": "A note below {{msg-wm|add-more-participants}}.",
	"add-organizer": "Link to add a new organizer to a program.",
	"add-wiki": "Link to add a wiki (also known as a 'project') to an event.\n{{Identical|Wiki}}",
	"all": "Label for the wiki when all wikis have been selected.\n{{Identical|All}}",
	"all-wikipedias": "Label for checkbox to make an Event for all Wikipedias.",
	"apply": "Label for button\n{{Identical|Apply}}",
	"attribution": "Text for a link that gives attribution to images and fonts used in the application.\n{{Identical|Attribution}}",
	"attribution-background": "Text giving credit to the background image (which is variable). $1 is a link to the image on Commons.",
	"attribution-font": "Text giving credit to the author of the font used in the application. $1 is a link to the font homepage, $2 is a link to the license, and $3 is a link to the author.",
	"attribution-font-awesome": "Text giving credit to the author of the Font Awsome icon set. $1 is a link to the font homepage, $2 is a link to the license, and $3 is a link to the author.",
	"byte-difference": "Heading for the column listing the number of bytes changed during a program, shown in the 'My Programs' table.",
	"byte-difference-during-event": "Heading for column listing the number of bytes changed to a page during an event. Used in the Pages Created report.",
	"calculate-totals": "Label for button to calculate the statistics for an event.",
	"cancel": "Label for button\n{{Identical|Cancel}}",
	"categories": "Label for section showing MediaWiki categories associated with an Event.\n{{Identical|Category}}",
	"categories-panel-title": "Title for the categories' filter form panel. Same function as {{msg-wm|participants-panel-title}}.",
	"categories-description": "Description of how categories are used to generate statistics.",
	"categories-description-tooltip": "Tooltip text for the help icon near {{msg-wm|categories-description}}.",
	"categories-explanation": "Additional explanation the category selection interface.",
	"categories-commons-explanation": "Additional explanation the category selection interface.",
	"category-warning-header": "Header for an error box describing incomplete filter state.",
	"category-warning-desc": "More detailed description in an error box, shown below {{msg-wm|category-warning-header}}. $1 is an HTML link containing the {{msg-wm|update-data}} text.",
	"category-name": "Placeholder for input to enter the name of a category.",
	"close": "Button text to close a modal.\n{{Identical|Close}}",
	"confirm-deletion": "Popup message confirming the user wants to delete the program or event. $1 is the name of the program or event.",
	"copy": "Text for link to copy a program or event.\n{{Identical|Copy}}",
	"create-new-event": "Heading for page to create a new event. This is also used as button text shown on the Program page.",
	"create-new-program": "Heading for page to create a new program. This is also used as button text shown on the 'My Programs' page.",
	"creator": "Label for the editor who created a page.\n{{Identical|Creator}}",
	"date": "Label for the date an edit was made.\n{{Identical|Date}}",
	"delete": "Text for link to delete a program or event.\n{{Identical|Delete}}",
	"developed-by": "Footer text to indicate author. 'Community Tech' is the name of the WMF team who developed the tool.",
	"diff": "Link to a MediaWiki diff on a wiki\n{{Identical|Diff}}",
	"documentation": "The word documentation. This is used as the text for a link to a documentation page.\n{{Identical|Documentation}}",
	"edit-program": "Heading for the page to edit a program.",
	"edit-summary": "'Edit summary' or 'comment' associated with an edit.\n{{Identical|Edit summary}}",
	"edits": "Heading for the column listing the number of edits made during a program, shown in the 'My Programs' table.",
	"edits-during-event": "Heading for column showing the number of edits made to a page during an event. Used in the Pages Created report.",
	"enable-event-times": "Label for checkbox to enable start/end dates for an event.",
	"end-date": "Label for the end date input field.",
	"end-time": "Label for the end time input field.",
	"error-categories": "Error message shown when invalid categories are entered (as in a MediaWiki category). $1 is the number of categories.",
	"error-event-retry": "Instructional text for when an unknown error occurred while updating an event. $1 is a link to report the issue, with the message 'error-event-retry-link' as the link text (which in English is 'report this issue').",
	"error-event-retry-link": "Text for the link to report an issue, used in the 'error-event-retry' message.",
	"error-event-timeout": "Error message shown when updating an event timed out.",
	"error-event-undeletable": "Error message shown when the user attempts to delete an Event that has one or more participants.",
	"error-filters-categories-desc": "Bullet-point help sentence about category filters.",
	"error-filters-categories-missing": "Bullet-point help label for a comma-separated list of wiki domain names.",
	"error-filters-combination": "Bullet-point help sentence describing the conjunctive nature of the filters.",
	"error-filters-desc": "Description of an error box when no filters are provided. Followed by a link with {{msg-wm|error-filters-desc-tooltip}} as the tooltip.",
	"error-filters-desc-tooltip": "Tooltip for a help link that follows {{msg-wm|error-filters-desc}} and {{msg-wm|category-warning-desc}}.",
	"error-filters-every-wiki": "Bullet-point help sentence about requiring some sort of filter for every wiki in an event.",
	"error-filters-header": "Header of an error box describing missing filters.",
	"error-filters-participants-desc": "Bullet-point help sentence about the participants filter.",
	"error-filters-participants-none": "Description shown in the participants form panel.",
	"error-filters-participants-or-categories": "Bullet-list help sentence about requiring at least one filter type.",
	"error-filters-wikidata": "Bullet-point help sentence describing the requirement of Participants if Wikidata is an event wiki. The word 'Wikidata' should be strongly emphasised with HTML.",
	"error-filters-wikidata-only": "Bullet-point help sentence telling the user that they've only selected Wikidata. The word 'Wikidata' should be strongly emphasised with HTML.",
	"error-filters-wikidata-panel": "Description shown in the participants' form panel.",
	"error-invalid": "Generic error message shown next to a field, indicating that it is invalid.",
	"error-non-organizer": "Error message saying a user can't view a program or event because they are not an organizer.",
	"error-not-found": "Error message shown when a user tries to view a program or event that does not exist.",
	"error-program-undeletable": "Error message shown when the user attempts to delete a Program that has one or more Events.",
	"error-query-timeout": "Error message shown when Event Metrics timed out. $1 is the timeout value in seconds.",
	"error-server-message": "Error message. $1 is the message given by the server.",
	"error-service-overload": "Error message shown when too many people are using Event Metrics.",
	"error-title-invalid-chars": "Error message shown when creating a program or event with a title containing invalid characters. $1 is a list of the characters that can't be in the title.",
	"error-title-numeric": "Error message shown when creating a program or event with a title that is only a number (does not contain any non-numerical characters).",
	"error-unconfigured-wiki": "Error message shown when a wiki is added (for a category, for instance), but the event is not configured to support that wiki. $1 is the domain name of the wiki.",
	"error-usernames": "Error message shown when invalid usernames are entered. $1 is the number of usernames.",
	"error-wikis": "Error message shown when invalid wikis are entered. $1 is the number of wikis.",
	"event": "Label for an event.\n{{Identical|Event}}",
	"event-all-edits": "Title of page that lists all edits that were made during an event.",
	"event-all-edits-report": "Title for the dialog box for downloading the 'all edits' report.",
	"event-created": "Message saying a event was created. $1 is the name of the event.",
	"event-deleted": "Message saying a event was deleted. $1 is the name of the event.",
	"event-download-csv": "Text for a button with which to download a CSV-format report.",
	"event-download-reports": "Label for dropdown menu that provides links to download event data.",
	"event-download-wikitext": "Text for a button with which to download a wikitext-format report.",
	"event-in-future": "Message saying an event is configured to take place in the future, so statistics can't be generated.",
	"event-list": "Title of page that list all the events belonging to a program.",
	"event-metrics": "Title of the Event Metrics application.",
	"event-metrics-welcome": "Message shown on the homepage. 'Event Metrics' is the name of the application.",
	"event-no-data": "Message saying that statistics have not been generated for the event yet.",
	"event-settings": "Name of the page to configure an event.",
	"event-summary": "Name of the page that shows the overall statistics for an event.",
	"event-summary-report": "Title for the dialog box for downloading the 'event summary' report.",
	"event-updated": "Message saying a event was updated. $1 is the name of the event.",
	"events": "Heading for the column listing the number of events that are in a program, in the 'My Programs' table.\n{{Identical|Events}}",
	"fatal-error": "Wording saying an unrecoverable error occurred\n{{Identical|Fatal error}}",
	"feedback": "Link in the footer to give feedback.\n{{Identical|Feedback}}",
	"file-usage": "Heading for the column listing the number of pages that used files that were uploaded during a program or event.",
	"file-usage-desc": "Description for the 'file usage' metric.",
	"files-uploaded": "Heading for the column listing the number of files updated during a program or event.",
	"help": "Label for the help button dropdown.\n{{Identical|Help}}",
	"help-translate": "Link to translation page on translatewiki, to encourage the user to help translate",
	"hide-section": "Tooltip text for the header of visible panels, to toggle them closed",
	"incoming-links": "Label for metric indicating the number of pages that link to a given page.",
	"items-created": "Heading for the column listing the number of Wikidata Items created during an event.",
	"items-created-desc": "Description for the 'items created' metric.",
	"items-improved": "Heading for the column listing the number of Wikidata Items improved during an event.",
	"items-improved-desc": "Description for the 'items improved' metric.",
	"last-updated": "Brief text showing when statistics were last updated. $1 is the date, in localized format.",
	"last-updated-table": "Heading for a report row showing when event statistics were last updated.",
	"login-with-oauth": "Label for button that allows the user to login with OAuth. This is shown on the homepage.",
	"logout": "Label for Log out button\n{{Identical|Log out}}",
	"metrics-about-link": "Text for link to documentation for the metrics available in Event Metrics.",
	"more-page-metrics": "Label for link to view more statistics. Used in the Pages Created report.",
	"my-programs": "Heading for the 'My Programs' page, which list all the programs an organizer has created.",
	"new-editors": "Heading for the column listing the number of new editors that participated in a program, shown in the 'My Programs' table.",
	"new-editors-desc": "Description for the 'new editors' metric. $1 is a number of days.",
	"no-categories": "Description shown in categories' form panel header when there are no categories.",
	"no-events": "Message shown on the Programs page when the user has not created any events yet.",
	"no-participants": "Description shown in categories' form panel header when there are no participants.",
	"no-programs": "Message shown when the user has not created any programs yet.",
	"no-results": "Notice telling the user that no results were found",
	"metadata-categories-label": "Label preceding a list of categories. $1 is the number of items in the list.",
	"metadata-end-date": "Label for the 'end date' field of event metadata.\n{{Identical|End date}}",
	"metadata-start-date": "Label for the 'start date' field of event metadata.",
	"metadata-wikis-label": "Label preceding a list of wikis. $1 is the number of items in the list.",
	"not-all-wikis-have-cats": "Description shown in categories' form panel header when some wikis are missing categories.",
	"num-categories": "Description text for the header of the categories' filter panel.\n$1 is the number of categories.",
	"num-days": "Conditional PLURAL form of 'day'. $1 is the number.\n{{Identical|Day}}",
	"num-hours": "Conditional PLURAL form of 'hour'. $1 is the number.\n{{Identical|Hour}}",
	"num-minutes": "Conditional PLURAL form of 'minute'. $1 is the number.\n{{Identical|Minute}}",
	"num-participants": "Description text for the header of the participants filter panel. $1 is the number of participants.",
	"num-revisions": "Conditional PLURAL form of 'revisions'. $1 is the number.\n{{Identical|Revision}}",
	"num-seconds": "Conditional PLURAL form of 'second'. $1 is the number.\n{{Identical|Second}}",
	"num-wikis": "Conditional PLURAL form of 'wiki'. $1 is the number.\n{{Identical|Wiki}}",
	"organizers": "Label for the field to enter the organizers of a program.",
	"page": "Label for the title of a wiki page.\n{{Identical|Page}}",
	"pager-newer-n": "This is part of the navigation on the top and bottom of lists of contributions that are ordered by date. $1 is the number of items shown per page.\n{{Identical|Newer}}",
	"pager-older-n": "This is part of the navigation on the top and bottom of lists of contributions that are ordered by date. $1 is the number of items shown per page.\n{{Identical|Older}}",
	"pages-created": "Heading for the column listing the number of pages created during a program, shown in the 'My Programs' table.",
	"pages-created-desc": "Description for the 'pages created' metric.",
	"pages-created-pageviews": "Label for the metric that indicates the number of pageviews there were to the pages created during an event.",
	"pages-created-report": "Title for the dialog box for downloading the 'pages created' report.",
	"pages-improved": "Heading for the column listing the number of pages improved during a program, shown in the 'My Programs' table.",
	"pages-improved-desc": "Description for the 'pages improved' metric.",
	"pages-improved-pageviews-avg": "Label for the metric that indicates the average daily pageviews there were to the pages improved during an event.",
	"pages-using-files": "Label for the metric indicating how many unique content pages use the files that were uploaded during the event.",
	"pages-using-files-pageviews-avg": "Label for the metric indicating the average pageviews to content pages that use the files that were uploading during the event.",
	"pageviews-average": "Label for value that is the average number of pageviews a page has received per day.",
	"pageviews-cumulative": "Label for value that is the number of pageviews a page has received to date.",
	"participants": "Heading for the column listing the number of participants of a program in the 'My Programs' table.",
	"participants-panel-title": "Title for the participants' form panel. Same function as {{msg-wm|categories-panel-title}}.",
	"please-login": "Error message saying the user needs to login in order to continue.",
	"program": "Heading for the column listing program titles in the 'My Programs' table.\n{{Identical|Program}}",
	"program-created": "Message saying a program was created. $1 is the name of the program.",
	"program-deleted": "Message saying a program was deleted. $1 is the name of the program.",
	"program-settings": "Name of the page to configure an program.",
	"program-updated": "Message saying a program was updated. $1 is the name of the program.",
	"queued": "Text shown on the 'Update stats' button when a job to generate the statistics is queued.\n{{Identical|Queued}}",
	"queued-desc": "Text shown while statistics are waiting to be generated.",
	"remove": "Text for button to remove a row from a table.\n{{Identical|Remove}}",
	"report-issue": "Link to report an issue or bug with the tool",
	"retention": "Heading for the column listing the N-day retention of participants of a program. Shown in the 'My Programs' table. $1 is the number of days.",
	"retention-desc": "Description for the 'retention' metric. $1 is a number of days.",
	"return-to-my-programs": "Text for link going back to the My Programs page.",
	"save": "Label for save button.\n{{Identical|Save}}",
	"save-categories": "Label for button to save the categories on an event.",
	"save-participants": "Label for button to save the participants to an event.",
	"select-report-format": "Text prompting the user to select from a set of buttons, each of which is for a different report format.",
	"settings": "Link that opens a settings page for an event, for example, to change the start and end dates.\n{{Identical|Settings}}",
	"show-section": "Tooltip text for the header of hidden panels, to toggle them open",
	"start-date": "Label for the start date input field.",
	"start-time": "Label for the start time input field.",
	"statistics": "Level-two heading for the event statistics.",
	"submit": "Submit button text\n{{Identical|Submit}}",
	"time": "Label for the time-related fields for creating an event.\n{{Identical|Time}}",
	"timezone": "Label for dropdown to select a timezone.\n{{Identical|Timezone}}",
	"title": "Label for the field to enter the title of a program or event.\n{{Identical|Title}}",
	"totals": "Label for the total number of pageviews\n{{Identical|Total}}",
	"unknown": "General term.\n{{Identical|Unknown}}",
	"update-data": "Label for button to update the statistics for an event.",
	"updating": "Label for the update button while calculation is in progress (the button is also disabled).",
	"updating-desc": "Text shown while statistics are being updated.",
	"url": "\n{{Identical|URL}}",
	"username": "Label for value showing the username of an editor.\n{{Identical|Username}}",
	"view-all-edits": "Link for button to view a list of all the edits made in an Event.",
	"view-source": "Link to the source code for the tool\n{{Identical|View source}}",
	"wiki": "Heading for column showing which wiki an edit was made on.\n{{Identical|Wiki}}",
	"wikidata-not-applicable": "Description for the 'categories' form panel when the only wiki is Wikidata.",
	"wikis": "Label for entering in one or more wikis that an event belongs to.\n{{Identical|Wiki}}"
}
