{
	"@metadata": {
		"authors": [
			"MusikAnimal"
		]
	},
	"add-category": "Link to add a new category to an event.",
	"add-more-participants": "Label for text area input to enter in multiple participants for an event.",
	"add-organizer": "Link to add a new organizer to a program.",
	"add-wiki": "Link to add a wiki (also known as a 'project') to an event.\n{{Identical|Wiki}}",
	"all": "Label for the wiki when all wikis have been selected.\n{{Identical|All}}",
	"all-wikipedias": "Label for checkbox to make an Event for all Wikipedias.",
	"apply": "Label for button\n{{Identical|Apply}}",
	"attribution": "Text for a link that gives attribution to images and fonts used in the application.\n{{Identical|Attribution}}",
	"attribution-background": "Text giving credit to the background image (which is variable). $1 is a link to the image on Commons.",
	"attribution-font": "Text giving credit to the author of the font used in the application. $1 is a link to the font homepage, $2 is a link to the license, and $3 is a link to the author.",
	"attribution-font-awesome": "Text giving credit to the author of the Font Awsome icon set. $1 is a link to the font homepage, $2 is a link to the license, and $3 is a link to the author.",
	"calculate-totals": "Label for button to calculate the statistics for an event.",
	"cancel": "Label for button\n{{Identical|Cancel}}",
	"categories": "Label for section showing MediaWiki categories associated with an Event.\n{{Identical|Category}}",
	"close": "Button text to close a modal.\n{{Identical|Close}}",
	"confirm-deletion": "Popup message confirming the user wants to delete the program or event. $1 is the name of the program or event.",
	"copy": "Text for link to copy a program or event.\n{{Identical|Copy}}",
	"create-new-event": "Heading for page to create a new event. This is also used as button text shown on the Program page.",
	"create-new-program": "Heading for page to create a new program. This is also used as button text shown on the 'My Programs' page.",
	"date": "Label for the date an edit was made.\n{{Identical|Date}}",
	"delete": "Text for link to delete a program or event.\n{{Identical|Delete}}",
	"developed-by": "Footer text to indicate author. 'Community Tech' is the name of the WMF team who developed the tool.",
	"diff": "Link to a MediaWiki diff on a wiki\n{{Identical|Diff}}",
	"documentation": "The word documentation. This is used as the text for a link to a documentation page.\n{{Identical|Documentation}}",
	"download-csv": "Label for link to download the raw statistics of an event as CSV.",
	"download-wiki-table": "Label for link to download the statistics of an event as a wiki table.",
	"edit-event": "Heading for the page to edit an event.",
	"edit-program": "Heading for the page to edit a program.",
	"edit-summary": "'Edit summary' or 'comment' associated with an edit.\n{{Identical|Edit summary}}",
	"enable-event-times": "Label for checkbox to enable start/end dates for an event.",
	"end-date": "Label for the end date input field.",
	"end-time": "Label for the end time input field.",
	"error-event-title-dup": "Error message shown when creating an event with the same title as an existing event. $1 the title.",
	"error-event-undeletable": "Error message shown when the user attempts to delete an Event that has one or more participants.",
	"error-failed": "Text shown on the 'Update stats' button when an error occurred. :( is an emoticon of a sad face.",
	"error-invalid": "Generic error message shown next to a field, indicating that it is invalid.",
	"error-internal": "Message shown when an unknown internal error occurred. $1 is a link to the feedback page where they can report the error.",
	"error-non-organizer": "Error message saying a user can't view a program or event because they are not an organizer.",
	"error-not-found": "Error message shown when a user tries to view a program or event that does not exist.",
	"error-program-title-dup": "Error message shown when creating a program with the same title as an existing program. $1 is the title.",
	"error-program-undeletable": "Error message shown when the user attempts to delete a Program that has one or more Events.",
	"error-query-timeout": "Error message shown when Grant Metrics timed out. $1 is the timeout value in seconds.",
	"error-server-message": "Error message. $1 is the message given by the server.",
	"error-service-overload": "Error message shown when too many people are using Grant Metrics.",
	"error-title-invalid-chars": "Error message shown when creating a program or event with a title containing invalid characters. $1 is a list of the characters that can't be in the title.",
	"error-title-reserved": "Error message shown when creating a program or event with a reserved (invalid) title. $1 is a list of the names that the title can't be.",
	"error-usernames": "Error message shown when invalid usernames are entered. $1 is the number of usernames.",
	"error-wikis": "Error message shown when invalid wikis are entered. $1 is the number of wikis.",
	"event": "Label for an event.\n{{Identical|Event}}",
	"event-created": "Message saying a event was created. $1 is the name of the event.",
	"event-data": "Title for the 'Event Data' page.",
	"event-data-for": "Title for the event data page, naming the event. $1 is the name of the event.",
	"event-deleted": "Message saying a event was deleted. $1 is the name of the event.",
	"event-in-future": "Message saying an event is configured to take place in the future, so statistics can't be generated.",
	"event-misconfig": "Message saying that the event needs more configuration before statistics can be generated. $1 is a list of things the user needs to add.",
	"event-no-data": "Message saying that statistics have not been generated for the event yet.",
	"event-updated": "Message saying a event was updated. $1 is the name of the event.",
	"events": "Heading for the column listing the number of events that are in a program, in the 'My Programs' table.\n{{Identical|Events}}",
	"fatal-error": "Wording saying an unrecoverable error occurred\n{{Identical|Fatal error}}",
	"feedback": "Link in the footer to give feedback.\n{{Identical|Feedback}}",
	"file-usage": "Heading for the column listing the number of pages that used files that were uploaded during a program or event.",
	"file-usage-desc": "Description for the 'file usage' metric.",
	"files-uploaded": "Heading for the column listing the number of files updated during a program or event.",
	"grant-metrics": "Title of the Grant Metrics application.",
	"help": "Label for the help button dropdown.\n{{Identical|Help}}",
	"help-translate": "Link to translation page on translatewiki, to encourage the user to help translate",
	"hide-section": "Tooltip text for the header of visible panels, to toggle them closed",
	"items-created": "Heading for the column listing the number of Wikidata Items created during an event.",
	"items-created-desc": "Description for the 'items created' metric.",
	"items-improved": "Heading for the column listing the number of Wikidata Items improved during an event.",
	"items-improved-desc": "Description for the 'items improved' metric.",
	"last-updated": "Brief text showing when statistics were last updated. $1 is the date, in localized format.",
	"login-with-oauth": "Label for button that allows the user to login with OAuth. This is shown on the homepage.",
	"logout": "Label for Log out button\n{{Identical|Log out}}",
	"my-programs": "Heading for the 'My Programs' page, which list all the programs an organizer has created.",
	"new-editors": "Heading for the column listing the number of new editors that participated in a program, shown in the 'My Programs' table.",
	"new-editors-desc": "Description for the 'new editors' metric. $1 is a number of days.",
	"no-events": "Message shown on the Programs page when the user has not created any events yet.",
	"no-programs": "Message shown when the user has not created any programs yet.",
	"no-results": "Notice telling the user that no results were found",
	"num-categories": "Conditional PLURAL form of 'category', as in a MediaWiki category. $1 is the number.\n{{Identical|Category}}",
	"num-days": "Conditional PLURAL form of 'day'. $1 is the number.\n{{Identical|Day}}",
	"num-hours": "Conditional PLURAL form of 'hour'. $1 is the number.\n{{Identical|Hour}}",
	"num-minutes": "Conditional PLURAL form of 'minute'. $1 is the number.\n{{Identical|Minute}}",
	"num-participants": "Conditional PLURAL form of 'participant'. $1 is the number.",
	"num-revisions": "Conditional PLURAL form of 'revisions'. $1 is the number.\n{{Identical|Revision}}",
	"num-seconds": "Conditional PLURAL form of 'second'. $1 is the number.\n{{Identical|Second}}",
	"num-wikis": "Conditional PLURAL form of 'wiki'. $1 is the number.\n{{Identical|Wiki}}",
	"organizers": "Label for the field to enter the organizers of a program.",
	"page": "Label for the title of a wiki page.\n{{Identical|Page}}",
	"pager-newer-n": "This is part of the navigation on the top and bottom of lists of contributions that are ordered by date. $1 is the number of items shown per page.\n{{Identical|Newer}}",
	"pager-older-n": "This is part of the navigation on the top and bottom of lists of contributions that are ordered by date. $1 is the number of items shown per page.\n{{Identical|Older}}",
	"pages-created": "Heading for the column listing the number of pages created during a program, shown in the 'My Programs' table.",
	"pages-created-desc": "Description for the 'pages created' metric.",
	"pages-improved": "Heading for the column listing the number of pages improved during a program, shown in the 'My Programs' table.",
	"pages-improved-desc": "Description for the 'pages improved' metric.",
	"participants": "Heading for the column listing the number of participants of a program in the 'My Programs' table.",
	"please-login": "Error message saying the user needs to login in order to continue.",
	"program": "Heading for the column listing program titles in the 'My Programs' table.\n{{Identical|Program}}",
	"program-created": "Message saying a program was created. $1 is the name of the program.",
	"program-deleted": "Message saying a program was deleted. $1 is the name of the program.",
	"program-updated": "Message saying a program was updated. $1 is the name of the program.",
	"queued": "Text shown on the 'Update stats' button when a job to generate the statistics is queued.\n{{Identical|Queued}}",
	"queued-desc": "Text shown while statistics are waiting to be generated.",
	"remove": "Text for button to remove a row from a table.\n{{Identical|Remove}}",
	"report-issue": "Link to report an issue or bug with the tool",
	"retention": "Heading for the column listing the N-day retention of participants of a program. Shown in the 'My Programs' table. $1 is the number of days.",
	"retention-desc": "Description for the 'retention' metric. $1 is a number of days.",
	"return-to-my-programs": "Text for link going back to the My Programs page.",
	"save-categories": "Label for button to save the categories on an event.",
	"save-participants": "Label for button to save the participants to an event.",
	"show-section": "Tooltip text for the header of hidden panels, to toggle them open",
	"start-date": "Label for the start date input field.",
	"start-time": "Label for the start time input field.",
	"statistics": "Level-two heading for the event statistics.",
	"submit": "Submit button text\n{{Identical|Submit}}",
	"time": "Label for the time-related fields for creating an event.\n{{Identical|Time}}",
	"timezone": "Label for dropdown to select a timezone.\n{{Identical|Timezone}}",
	"title": "Label for the field to enter the title of a program or event.\n{{Identical|Title}}",
	"totals": "Label for the total number of pageviews\n{{Identical|Total}}",
	"unknown": "General term.\n{{Identical|Unknown}}",
	"update-data": "Label for button to update the statistics for an event.",
	"updating": "Label for the update button while calculation is in progress (the button is also disabled).",
	"updating-desc": "Text shown while statistics are being updated.",
	"username": "Label for value showing the username of an editor.\n{{Identical|Username}}",
	"view-all-data": "Link for button to view the full data for an Event.",
	"view-source": "Link to the source code for the tool\n{{Identical|View source}}",
	"welcome": "Message shown on the homepage. 'Grant Metrics' is the name of the application.",
	"wiki": "Heading for column showing which wiki an edit was made on.\n{{Identical|Wiki}}",
	"wikis": "Label for entering in one or more wikis that an event belongs to.\n{{Identical|Wiki}}"
}
